import '../main_selector/main_selector.css';

export default () => {
    return (
            <div class='worldtop'>
                <div class='largeanimebox'>
                    <img src='img/frieren.jpeg' />
                    <a><h1>Провожающая в последний путь Фрирен</h1> Sousou no Frieren <h2>Одержав победу над Королём демонов, отряд  героя Химмеля вернулся домой. Приключение, растянувшееся на десятилетие, подошло к завершению. Волшебница-эльф Фрирен и её отважные товарищи принесли людям мир и разошлись в разные стороны, чтобы спокойно прожить остаток жизни. Однако не всех членов отряда ждёт одинаковая участь. Для эльфов время течёт медленее.</h2></a>
                </div>
                <div class='largeanimebox'>
                    <img src='img/alchem.jpeg' />
                    <a><h1>Стальной алхимик: Братство</h1> Fullmetal Alchemist: Brotherhood  <h2>Ремейк одноимённого аниме-сериала «Стальной алхимик» 2003 года, более строго следующий событиям, описанным в манге.
В этом мире существуют алхимики — люди, владеющие искусством алхимии, способностью манипулировать материей и преобразовывать вещество. Все они ограничены основным Законом алхимии:</h2></a>
                </div>
                <div class='largeanimebox'>
                    <img src={'img/stein.jpeg'} />
                    <a><h1>Врата Штейна</h1> Steins;Gate <h2>Сняв в Акихабаре квартиру, самопровозглашённый сумасшедший учёный Окабэ Ринтаро устроил там «лабораторию» и в компании своей подруги детства Сины Маюри и хакера-отаку Хасиды Итару изобретает «гаджеты будущего». Троица отлично проводит время вместе, работая над совместным проектом — «мобиловолновкой», которой можно управлять с помощью текстовых сообщений.  sssss   ssssss</h2></a>
                </div>
            </div>
    )
}