

export const WatchedStatus = {
    Watched:'Просмотрено',
    Unwatched:'Не просмотрено'
};

export const cardList = [
    {
        id:'1',
        img:'img/frieren.jpeg',
        ru_name:'Провожающая в последний путь Фрирен',
        en_name:'Sousou no Frieren',
        sinops:'Одержав победу над Королём демонов, отряд героя Химмеля вернулся домой. Приключение, растянувшееся на десятилетие, подошло к завершению. Волшебница-эльф Фрирен и её отважные товарищи принесли людям мир и разошлись в разные стороны, чтобы спокойно прожить остаток жизни. Однако не всех членов отряда ждёт одинаковая участь. Для эльфов время течёт иначе, поэтому Фрирен вынужденно становится свидетелем того, как её спутники один за другим постепенно уходят из жизни. Девушка осознала, что годы, проведённые в отряде героя, пронеслись в один миг, как падающая звезда в бескрайнем космосе её жизни, и столкнулась с сожалениями об упущенных возможностях. Сможет ли она смириться со смертью друзей и понять, что значит жизнь для окружающих её людей? Фрирен начинает новое путешествие, чтобы найти ответ.',
        rate:'9.36',
        tags:['Сёнен', 'Приключение', 'Драма', 'Фэнтези'],
        watched:WatchedStatus.Unwatched
    },
    {
        id:'2',
        img:'img/alchem.jpeg',
        ru_name:'Стальной алхимик: Братство',
        en_name:'Fullmetal Alchemist: Brotherhood',
        sinops:'Ремейк одноимённого аниме-сериала «Стальной алхимик» 2003 года, более строго следующий событиям, описанным в манге.\n' +
            '\n' +
            'В этом мире существуют алхимики — люди, владеющие искусством алхимии, способностью манипулировать материей и преобразовывать вещество. Все они ограничены основным Законом алхимии: нельзя алхимическим путём получить что-то, не пожертвовав чем-то равноценным полученному. Лишь с помощью легендарного философского камня, способ создания которого утерян, можно обойти этот Закон.\n' +
            'Главные герои, братья Эдвард и Альфонс Элрики, пострадали в детстве при попытке вернуть к жизни свою мать, умершую от болезни. Они забыли основной Закон алхимии и жестоко поплатились за это: Альфонс потерял всё своё тело, а Эдвард — руку и ногу. Эдвард сумел спасти лишь душу Альфонса, запечатав её в старинных доспехах.\n' +
            'Спустя много лет Эдвард сдаёт государственный экзамен на звание алхимика и получает прозвище «Стальной Алхимик». Братья начинают путешествие с целью найти философский камень и вернуть с его помощью утраченное много лет назад.',
        rate:'9.09',
        tags:['Сёнен','Приключение','Драма','Экшен'],
        watched:WatchedStatus.Unwatched
    },
    {
        id:'3',
        img:'img/stein.jpeg',
        ru_name:'Врата Штейна',
        en_name:'Steins;Gate',
        sinops:'Сняв в Акихабаре квартиру, самопровозглашённый сумасшедший учёный Окабэ Ринтаро устроил там «лабораторию» и в компании своей подруги детства Сины Маюри и хакера-отаку Хасиды Итару изобретает «гаджеты будущего». Троица отлично проводит время вместе, работая над совместным проектом — «мобиловолновкой», которой можно управлять с помощью текстовых сообщений.\n' +
            'Вскоре «сотрудники лаборатории» сталкиваются с чередой загадочных инцидентов, которые приводят к открытию, изменившему правила игры: «мобиловолновка» может отправлять электронные письма в прошлое и таким образом изменять историю.',
        rate:'9.07',
        tags:['Драма','Фантастика','Триллер', 'Психологическое'],
        watched:WatchedStatus.Unwatched
    },
    {
        id:'4',
        img:'img/k-on.jpeg',
        ru_name:'Кэйон!',
        en_name:'K-On!',
        sinops:'Юи Хирасава — молодая и беззаботная девушка, только-только поступившая в старшую школу. В первый же день учёбы она замечает рекламный плакат «клуба лёгкой музыки» и, загоревшись желанием вступить туда, отправляется записываться в участники.\n' +
            'Она приходит в комнату клуба, где её тепло встречают находящиеся там девушки: Рицу Тайнака, Мио Акияма и Цумуги Котобуки. Когда выясняется, что Юи не умеет играть ни на одном музыкальном инструменте, её, несмотря на это, убеждают вступить хотя бы для того, чтобы предотвратить роспуск клуба. А после прослушивания небольшой композиции интерес у Юи разгорается лишь сильнее, и она решает научиться играть на гитаре.\n' +
            'Пролетают неделя за неделей; наряду со школьными занятиями и домашней работой Юи учится игре на гитаре, попутно сталкиваясь со множеством проблем и с различным успехом решая их — не без помощи новообретённых подруг. Ей ещё далеко до совершенства, а школьный фестиваль всё ближе и ближе... Успеет ли «клуб лёгкой музыки» подготовиться к своему дебютному выступлению?',
        rate:'7.86',
        tags:['Музыка','Школа'],
        watched:WatchedStatus.Unwatched
    },
    {
        id:'5',
        img:'img/nhk.jpeg',
        ru_name:'Добро пожаловать в NHK',
        en_name:'NHK ni Youkoso!',
        sinops:'Тацухиро Сато — 22-летний парень, считающий, что всё происходящее вокруг него — результат заговора. У него нет ни работы, ни друзей, ни девушки, он испытывает трудности в общении с людьми и из дома практически не выходит. Таких, как он, в Японии называют хикикомори.\n' +
            'Сато уверен, что причина всего — NHK (Nihon Housou Kyoukai — «Японская радиовещательная корпорация», но Сато читает аббревиатуру как Nihon Hikikomori Kyoukai — «Японская корпорация хикикомори»). Именно NHK стоят за обращением людей в хикикомори.\n' +
            'Сато просидел взаперти три года, и уже подходит к концу четвёртый. Парень отчаянно нуждается в помощи и понимает, что ему нужно выйти наружу и найти работу, однако это слишком пугает его.\n' +
            'Но всё меняется, когда он оказывается выбран для участия в неком «проекте», целью которого является помощь таким, как он, — людям, ставшим хикикомори. В дом Сато приходит девушка по имени Мисаки Накахара...',
        rate:'8.31',
        tags:['Драма','Комедия','Триллер'],
        watched:WatchedStatus.Unwatched
    },
    {
        id:'6',
        img:'img/titans.jpeg',
        ru_name:'Атака титанов 3. Часть 2',
        en_name:'Shingeki no Kyojin Season 3 Part 2',
        sinops:'Прямое продолжение аниме «Атака титанов 3». Экранизация седьмой по счёту сюжетной арки манги за авторством Хадзимэ Исаямы.\n' +
            '\n' +
            'Внутри стен снова настали мирные времена, и разведотряд готовится к новой вылазке за стену «Роза», прямиком в Шиганшину. Благодаря Ханджи разработка нового оружия для убийства титанов почти без участия людей идёт полным ходом, а к солдатам вернулась давно утраченная надежда на спасение всего человечества. Но в Шиганшине наших героев подстерегает невиданная опасность, способная уничтожить все планы Эрвина на возвращение стены «Мария» и разрушить все мечты узнать, что же таится в секретном подвале старого дома Эрена и Микасы.',
        rate:'9.05',
        tags:['Сёнен', 'Экшен', 'Драма', 'Триллер'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '7',
        img: 'img/mha1.jpeg',
        ru_name: 'Моя геройская академия',
        en_name: 'Boku no Hero Academia',
        sinops: 'Четырнадцатилетний Идзуку Мидория рано осознал, что люди не рождаются равными. А пришло это понимание, когда его начали дразнить одноклассники, одарённые особой силой. Несмотря на то, что большинство людей в этом мире рождаются с необычными способностями, Идзуку оказался среди тех немногих, кто напрочь их лишён. Однако это не стало помехой для мальчика в стремлении стать таким же легендарным героем, как Всемогущий. Для осуществления мечты Идзуку не без помощи своего кумира поступает в самую престижную академию героев — Юэй. Но это, очевидно, лишь начало его удивительных приключений.',
        rate:'7.87',
        tags:['Школа', 'Супер сила'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '8',
        img: 'img/violet.jpeg',
        ru_name: 'Вайолет Эвергарден',
        en_name: 'Violet Evergarden',
        sinops: 'Вайолет Эвергарден, молодая девушка, чья жизнь — не что иное, как война, послушно служит под командованием майора Гилберта Бугенвиллеи из армии Ляйденшафтлиха.\n' +
            'После серьёзных увечий, оставивших её без рук и разделивших с Гилбертом, она покинула поле боя и была взята под опеку бывшим командующим армии Клаудией Ходжинсом, который после окончания войны основал почтовую службу «C-H» в крупном портовом городе Ляйден. Эта компания осуществляет регулярные почтовые пересылки и предоставляет услуги «автозапоминающих кукол» — талантливых девушек, в чьи обязанности входит написание писем и корректировка текста для большей части неграмотного населения города.\n' +
            'В конечном итоге, тронутая работой автозапоминающих кукол, Вайолет решает присоединиться к команде, чтобы узнать судьбу майора Гилберта и смысл последних слов, сказанных им: «Я люблю тебя».',
        rate:'8.67',
        tags:['Драма', 'Фэнтези'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '9',
        img: 'img/town.jpeg',
        ru_name: 'Город, в котором меня нет',
        en_name: 'Boku dake ga Inai Machi',
        sinops: 'Жизнь мангаки нелегка. Тяжёлый и кропотливый труд по достоинству вознаграждается в редких случаях. Авторские работы, в которые были вложены душа и нравоучительный посыл, не всегда достигают сердец читателей. Однажды понять, что ты пустой и скучный человек, не способный на большее — самый большой страх в жизни мангаки.\n' +
            'Сатору Фудзинума тоже автор. В свои двадцать восемь лет он трудится не покладая рук и стремится к намеченной цели. Однако не все авторы гении, и далеко не у каждого получается выразить себя в своих работах. «Каким должен быть главный герой?», «Должен ли он быть достаточно похож на меня?», «Чего ему не хватает?», «Чего не хватает мне?» Такими вопросами ежедневно задаётся Сатору и, как многие, боится однажды увидеть себя пустым и скучным.\n' +
            'Но разве пустые и скучные люди могут так же ловко подмечать в своем окружении разные мелочи? Могут ли они, воспользовавшись этим, с безграничной самоотдачей помогать людям? Сатору может. Но признавать это в себе, то, что делает его далеко не посредственным, он не хочет. Впрочем, как и называть свой дар сверхъестественным. Ведь, в сущности, этот хмурый мангака имеет возможность не просто подмечать мелочи. Он может, хоть и непроизвольно, «перематывать» время обратно, что уж точно нельзя назвать обычным.\n' +
            'Но для чего ему дана эта сила? Быть может, для того, чтобы исправить ошибки прошлого? Ведь когда-то давно, когда друзьям и знакомым Сатору грозила опасность, он, будучи ребёнком, не смог им помочь. Это до сих пор тяжким грузом лежит на его плечах. И вот теперь, когда затаившаяся угроза из прошлого вновь показала клыки, способность Сатору весьма изощрённо проявила себя, но тем самым и предоставила ему возможность не допустить однажды уже случившуюся трагедию.',
        rate:'8.3',
        tags:['Сэйнэн', 'Тайна', 'Триллер', 'Психологическое'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '10',
        img: 'img/masseffect.jpeg',
        ru_name: 'Масс Эффект: Потерянный идеал',
        en_name: 'Mass Effect: Paragon Lost',
        sinops: 'Фильм повествует о событиях, случившихся с лейтенантом Джеймсом Вегой в 2185 году, после разрушения первой «Нормандии» и исчезновения капитана Шепарда. В системах Терминус бесследно исчезают человеческие колонии. После неудачи «Властелина» появились новые враги. Когда угроза надвигается на колонию, которую охраняет Вега, лейтенанту придется спасать свой дом, не ожидая никаких подкреплений, полагаясь только на себя и на свою команду, как всегда делал его герой — капитан Шепард. Джеймс узнает, чего стоит каждое решение, и понимает, что иногда нет правильного выбора, есть лишь ошибки, с которыми придется жить.',
        rate:'6.27',
        tags:['Экшен', 'Приключение', 'Фантастика'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '11',
        img: 'img/deep.jpeg',
        ru_name: 'Безумное погружение: Потерянное дитя',
        en_name: 'Deep Insanity: The Lost Child',
        sinops: 'Человечество пошатнулось от неизвестного заболевания, ударившего по миллионам людей во всём мире. Синдром Рэндольфа — так его стали называть — опасен тем, что без каких-либо предпосылок ввергает заражённых в безумие и непробудную кому. Вскоре становится ясно, что болезнь возникла из недавно открывшегося в Антарктиде гигантского разлома, глубины которого покрывают неизведанные наукой ресурсы, а населяют его странные существа. Бездонные слои новой таинственной области посеяли в сердцах людей зёрна безумия, не менее опасного, чем сам синдром. В тщетных попытках достичь богатства, реализовать свои амбиции или же банально утолить жажду приключений многие погибли, так и не сумев получить желаемое.\n' +
            '\n' +
            'Сигурэ Даниэль Кай ищет нечто более важное — лекарство, однако существует ли оно? Или от этой болезни, охватившей умы, нет исцеления? Ответ можно узнать, лишь с головой погрузившись в недры этого удивительного мира',
        rate:'5.59',
        tags:['Фантастика'],
        watched:WatchedStatus.Unwatched
    },
    {
        id: '12',
        img: 'img/cyber.jpeg',
        ru_name: 'Киберпанк: Бегущие по краю',
        en_name: 'Cyberpunk: Edgerunners',
        sinops: 'Найт-Сити — город будущего, оснащённый всевозможными новейшими технологиями. Город, где модификация тела не просто мечты безумных учёных, а реальность сродни обычной покупке. Именно там живёт наш юный герой, для которого этот город не является чем-то невообразимым, он знает всю его настоящую суть, где выживание не просто слово, а истинное лицо этого мира. В один миг потеряв всё, что имел, парень не опускает рук и в борьбе за выживание становится киберпанком — городским наёмником вне закона.',
        rate:'8.6',
        tags:['Жестокость', 'Экшен', 'Фантастика'],
        watched:WatchedStatus.Unwatched
    }
]


export const allTags = () => {
    let Tags = []
    cardList.forEach(item => Tags = Tags.sort().concat(item.tags))
    let UniqTags = [...new Set(Tags)]
    return UniqTags
}



