const cardList =[
    {
        id:'123',
        img:'img/frieren.jpeg',
        ru_name:'Провожающая в последний путь Фрирен',
        en_name:'Sousou no Frieren',
        sinops:'Одержав победу над Королём демонов, отряд  героя Химмеля вернулся домой. Приключение, растянувшееся на десятилетие, подошло к завершению. Волшебница-эльф Фрирен и её отважные товарищи принесли людям мир и разошлись в разные стороны, чтобы спокойно прожить остаток жизни. Однако не всех членов отряда ждёт одинаковая участь. Для эльфов время течёт медленее.',
    },
    {
        id:'234',
        img:'img/alchem.jpeg',
        ru_name:'Стальной алхимик: Братство',
        en_name:'Fullmetal Alchemist: Brotherhood',
        sinops:'Ремейк одноимённого аниме-сериала «Стальной алхимик» 2003 года, более строго следующий событиям, описанным в манге. В этом мире существуют алхимики — люди, владеющие искусством алхимии, способностью манипулировать материей и преобразовывать вещество. Все они ограничены основным Законом алхимии:'
    }
]